# vi:syntax=ruby

tap "homebrew/bundle"
tap "homebrew/services"

tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "sass/sass"
tap "stripe/stripe-cli"
# tap "yt-dlp/taps"
# tap "bramstein/webfonttools"
# tap "brewsci/science"

brew "act"
brew "antigen"
brew "aria2"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "bash"
brew "bat"
brew "bat-extras"
brew "bottom"
brew "bzip2"
brew "ccache"
brew "cloudflare-wrangler2"
brew "corepack"
brew "coreutils"
brew "cvs"
brew "datasette"
brew "deno"
brew "direnv"
brew "dive"
brew "dprint"
brew "dust"
brew "eget"
brew "exiftool"
brew "eza"
brew "fastlane"
brew "fd"
brew "findutils"
brew "fish"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-sizer"
brew "go"
brew "goaccess"
brew "gojq"
brew "gpg"
brew "graphicsmagick"
brew "graphviz"
brew "hadolint"
brew "hexyl"
brew "htmlq"
brew "htop"
brew "httpie"
brew "hurl"
brew "hyperfine"
brew "inetutils"
brew "ios-deploy"
brew "jq"
brew "just"
brew "k6"
brew "libev"
brew "libmagic"
brew "mage"
brew "make"
brew "mkcert"
brew "nasm"
brew "neovim"
brew "nginx", restart_service: :changed
brew "node"
brew "nss"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pdm"
brew "pg_top"
brew "pgformatter"
brew "pigz"
brew "pkg-config"
brew "pngcrush"
brew "podman"
brew "podman-compose"
brew "pstree"
brew "pv"
brew "py-spy"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
brew "readline"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "sccache"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "sile"
brew "sqlite"
brew "starship"
brew "stylua"
brew "swiftformat"
brew "swiftlint"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "uv"
brew "vapor"
brew "viddy"
brew "vips"
brew "watchexec"
brew "watchman"
brew "wget"
brew "woff2"
brew "wrk"
brew "xcodegen"
brew "xdg-ninja"
brew "xh"
brew "xsv"
brew "xz"
brew "yasm"
brew "yt-dlp"
brew "zlib"
brew "zig"
brew "zsh"
brew "zsh-completions"

brew "bun"
brew "heroku/brew/heroku"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: [
     "with-fdk-aac",
     "with-libbluray",
     "with-libsoxr",
     "with-libvidstab",
     "with-opencore-amr",
     "with-openjpeg",
     "with-rubberband",
     "with-speex",
     "with-tesseract",
     "with-webp",
     "with-xvid",
]
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "sass/sass/migrator"
brew "stripe/stripe-cli/stripe"

# brew "asciinema"
# brew "circleci"
# brew "carthage"
# brew "brewsci/science/butterflow"
# brew "cmake"
# brew "git-flow"
# brew "ideviceinstaller"
# brew "libimobiledevice", args: ["HEAD"]
# brew "libusbmuxd", args: ["HEAD"]
# brew "lua"
# brew "luajit"
# brew "luarocks"
# brew "mercurial"
# brew "netlify-cli"
# brew "ninja"
# brew "pgbouncer", restart_service: :changed
# brew "postgis"
# brew "postgres", restart_service: :changed
# brew "rabbitmq"
# brew "rbenv"
# brew "swiftgen"

# Casks

cask "alacritty"
cask "arc"
cask "basictex"
cask "bitwarden"
# cask "chromedriver"
cask "dash"
cask "docker"
cask "epoch-flip-clock"
cask "firefox"
cask "firefox@developer-edition"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-eb-garamond"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-gentium-plus"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-libertinus"
cask "font-redhat"
cask "font-roboto"
cask "font-roboto-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "github"
cask "google-chrome"
cask "google-chrome@dev"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "handbrake"
cask "inkscape"
cask "insomnia"
cask "kitty"
cask "marta"
cask "operadriver"
cask "pgadmin4"
cask "podman-desktop"
cask "postman"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "rectangle"
cask "rio"
cask "safari-technology-preview"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "via"
cask "vitals"
cask "vlc"
cask "wezterm"
cask "wireshark"

# cask "iterm2"
# cask "dotnet-sdk"
# cask "falcon-sql-client"
# cask "love"
# cask "next"
# cask "powershell"
# cask "swiftformat-for-xcode"
# cask "vanilla"
# cask "virtualbox"
# cask "zettlr"
# cask "wkhtmltopdf"
