# vi:syntax=ruby

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "adoptopenjdk/openjdk"
# tap "bramstein/webfonttools"
# tap "brewsci/science"
tap "dart-lang/dart"
tap "github/gh"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "sass/sass"
tap "stripe/stripe-cli"
tap "stripe/stripe-mock"
tap "yt-dlp/taps"

brew "act"
brew "antigen"
brew "aria2"
brew "asciinema"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bandwhich"
brew "bash"
brew "bzip2"
brew "carthage"
brew "ccache"
brew "circleci"
brew "cloudflare-wrangler"
brew "cmake"
brew "coreutils"
brew "cvs"
brew "datasette"
brew "deno"
brew "direnv"
brew "dive"
brew "exiftool"
brew "fastlane"
brew "fd"
brew "findutils"
brew "fish"
brew "geckodriver"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "git-sizer"
brew "go"
brew "goaccess"
brew "gpg"
brew "graphicsmagick"
brew "graphviz"
brew "hadolint"
brew "hexyl"
brew "htmlq"
brew "htop"
brew "ideviceinstaller"
brew "inetutils"
brew "ios-deploy"
brew "jq"
brew "libev"
brew "libimobiledevice", args: ["HEAD"]
brew "libmagic"
brew "libusbmuxd", args: ["HEAD"]
brew "make"
brew "mercurial"
brew "mkcert"
brew "nasm"
brew "neovim"
brew "netlify-cli"
brew "nginx", restart_service: :changed
brew "ninja"
brew "node"
brew "nss"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "parallel"
brew "pg_top"
brew "pgbouncer", restart_service: :changed
brew "pgformatter"
brew "pkg-config"
brew "pngcrush"
brew "pnpm"
brew "podman"
brew "postgis"
brew "postgres", restart_service: :changed
brew "pstree"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python"
# brew "rabbitmq"
brew "rbenv"
brew "readline"
brew "redis", restart_service: :changed
brew "ripgrep"
brew "sccache"
brew "shellcheck"
brew "showkey"
brew "sqlite"
brew "starship"
brew "swiftformat"
brew "swiftgen"
brew "swiftlint"
brew "tmux"
# brew "vapor"
brew "vips"
brew "watchman"
brew "wget"
brew "woff2"
brew "wrk"
brew "xcodegen"
brew "xh"
brew "xz"
brew "yarn"
brew "yasm"
brew "yt-dlp/taps/yt-dlp"
brew "zlib"
brew "zsh"
brew "zsh-completions"

brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: [
     "with-fdk-aac",
     "with-libbluray",
     "with-webp",
     "with-tesseract",
     "with-openjpeg",
     "with-speex",
     "with-xvid",
     "with-rubberband",
     "with-opencore-amr",
     "with-libvidstab",
     "with-libsoxr",
]
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "sass/sass/migrator"
brew "stripe/stripe-cli/stripe"
brew "stripe/stripe-mock/stripe-mock"

# brew "brewsci/science/butterflow"
# brew "lua"
# brew "luajit"
# brew "luarocks"

# Casks
cask "adoptopenjdk11"
cask "alacritty"
cask "chromedriver"
cask "docker"
# cask "dotnet-sdk"
cask "epoch-flip-clock"
cask "firefox"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono-pl"
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrainsmono-nerd-font"
cask "font-redhat"
cask "font-roboto"
cask "font-robotomono-nerd-font"
cask "font-victormono-nerd-font"
cask "github"
cask "google-chrome-canary"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "handbrake"
cask "inkscape"
cask "insomnia"
cask "iterm2"
cask "operadriver"
cask "pgadmin4"
cask "postman"
cask "provisionql"
cask "safari-technology-preview"
cask "spectacle"
cask "spotify"
cask "swiftformat-for-xcode"
cask "virtualbox"
cask "vlc"
cask "wireshark"
cask "wkhtmltopdf"

# cask "zettlr"
# cask "falcon-sql-client"
# cask "love"
# cask "next"
# cask "powershell"
# cask "vanilla"
